public class Main {
    public static void main(String[] args) {
// Объявите переменные типа int, byte, short, long, float, double.
// Выведите в консоль значение каждой переменной в формате "Значение переменной … с типом … равно …"
        System.out.println("Hello world!");
    }
}